# 🔹 Подробный алгоритм расчёта дней отсутствия для ILR (Global Talent)

## 📌 Входные данные:
1. **Список всех поездок за границу** (отъезд – въезд):
   - Даты **выезда из UK** и **возвращения** (формат `ДД.ММ.ГГГГ`).
   - Если поездка была однодневная, считать её как **1 день отсутствия**.
   - Если вернулись **на следующий день**, считать **2 дня отсутствия**.
   - Если покинули UK в **один год, а вернулись в другой**, учитывать в **двух скользящих годах**.

2. **Текущая дата** (например, `05.03.2025`).

3. **Дата первого въезда в UK** (например, `29.12.2023`).

---

## 📌 Логика расчёта:
1. **Определить "плавающий" 12-месячный период**.
   - Например, если сегодня `05.03.2025`, то анализируем период **с 06.03.2024 по 05.03.2025**.

2. **Собрать все поездки, пересекающие этот период**.
   - Если поездка началась **до начала плавающего года**, но закончилась **внутри него**, учитывать **только часть дней**.
   - Если поездка началась и закончилась **внутри плавающего года**, учитывать её полностью.
   - Если поездка закончилась **после текущей даты**, учитывать **только прошедшие дни**.

3. **Суммировать дни отсутствия в каждом плавающем году**.
   - Проверить, не превышает ли сумма **180 дней в любом 12-месячном периоде**.

4. **Вывести результаты:**
   - ✅ Общее количество дней отсутствия за последние **12 месяцев**.
   - ✅ Сколько дней можно ещё отсутствовать **до лимита 180 дней**.
   - ✅ Когда можно снова уехать, чтобы не нарушить лимит.

---

## 📌 Пример таблицы для Excel (пример данных):

| Дата выезда | Дата возвращения | Дни отсутствия | Учитывается в периоде (с 06.03.2024) |
|------------|---------------|--------------|--------------------------------|
| 10.05.2024 | 20.05.2024    | 10          | ✅ 10 дней                    |
| 01.09.2024 | 30.09.2024    | 30          | ✅ 30 дней                    |
| 05.01.2025 | 15.01.2025    | 10          | ✅ 10 дней                    |
| **ИТОГО**  |               | **50 дней** | Осталось **130 дней** до лимита |

---

## 📌 Python-код для автоматического расчёта:
```python
from datetime import datetime, timedelta

# Входные данные: список поездок
trips = [
    {"departure": "10.05.2024", "return": "20.05.2024"},
    {"departure": "01.09.2024", "return": "30.09.2024"},
    {"departure": "05.01.2025", "return": "15.01.2025"},
]

# Указываем текущую дату
current_date = datetime.strptime("05.03.2025", "%d.%m.%Y")

# Вычисляем начало плавающего года (12 месяцев назад)
rolling_year_start = current_date - timedelta(days=365)

# Подсчёт отсутствий в текущем плавающем году
total_absence_days = 0

for trip in trips:
    dep_date = datetime.strptime(trip["departure"], "%d.%m.%Y")
    ret_date = datetime.strptime(trip["return"], "%d.%m.%Y")

    # Учитываем только те дни, которые попадают в 12-месячный период
    if ret_date >= rolling_year_start:
        start_count = max(dep_date, rolling_year_start)
        absence_days = (ret_date - start_count).days + 1
        total_absence_days += absence_days

# Вычисляем, сколько дней осталось до лимита 180
remaining_days = 180 - total_absence_days

print(f"Вы отсутствовали {total_absence_days} дней за последние 12 месяцев.")
print(f"Вы можете ещё отсутствовать {remaining_days} дней, чтобы не превысить лимит.")

## Итоговый алгоритм расчёта:
	1.	Выберите текущую дату.
	2.	Определите 12-месячный период назад.
	3.	Соберите все поездки за этот период.
	4.	Суммируйте дни отсутствия.
	5.	Сравните с лимитом 180 дней.
	6.	Выведите остаток допустимых дней.
	7.	Если лимит приближается, планируйте поездки осторожно.